import * as yup from 'yup'
import { employmentType } from '../data/employmentType.jsx';

export const editUserSchema = yup.object().shape({
    password: yup.string()
        .min(8, 'Паролата трябва да съдържа поне 8 символа.')
        .max(50, 'Паролата не може да бъде по-дълга от 50 символа.')
        .matches(/^(?=.*[a-zа-я])(?=.*[A-ZА-Я])(?=.*[0-9])(?=.*[@$!%*?&#])[a-zA-Zа-яА-Я0-9@$!%*?&#]+$/,
            'Паролата трябва да съдържа поне една малка буква, една главна буква, една цифра и един специален символ.')
        .required('Паролата е задължителна!'),
    phoneNumber: yup.string()
        .matches(/^(?:\+359|0)[1-9]\d{8}$/, 'Моля, въведете валиден телефонен номер.')
        .required('Телефонният номер е задължителен!'),
    email: yup.string()
        .email()
        .matches(/^[^\s@]+@[^\s@]+\.[^\s@]+$/)
        .required('Имейлът е задължителен!'),
    address: yup.string()
        .matches(/^[А-Яа-я0-9\s.,-]+$/, 'Адресът трябва да съдържа само букви на кирилица, цифри, интервали, запетайки, точки и тирета.')
        .min(5, 'Адресът трябва да съдържа поне 5 символа.')
        .max(100, 'Адресът не може да бъде по-дълъг от 100 символа.')
        .required('Адресът е задължителен!'),
    employment: yup.string()
        .required('Типът заетост е задължителен!'),
}) 